---
layout: post
title: "羽夏逆向指引——反制"
date: "2022-03-27T10:19:11.283Z"
---
羽夏逆向指引——反制
==========

羽夏逆向指引之反制，介绍常见的反调试措施。

写在前面
----

  此系列是本人一个字一个字码出来的，包括示例和实验截图。**可能有错误或者不全面的地方，如有错误，欢迎批评指正，本教程将会长期更新。** 如有好的建议，欢迎反馈。码字不易，如果本篇文章有帮助你的，如有闲钱，可以打赏支持我的创作。如想转载，请把我的转载信息附在文章后面，并声明我的个人信息和本人博客地址即可，但**必须事先通知我**。

> 你如果是从中间插过来看的，请仔细阅读 **[羽夏逆向指引——序](https://www.cnblogs.com/wingsummer/p/15569827.html)** ，方便学习本教程。

前言
--

  本篇讲解常见的在3环的破解者常见的破解措施以及反制，不要跟我讲0环的，在0环我可以随便搞3环的程序，权限大压死等级低的程序。本篇主要是介绍常见的，故不能涵盖绝大多数的。

随机基址
----

  英文缩写为`ASLR`，它是一种针对缓冲区溢出的安全保护技术，通过对堆、栈、共享库映射等线性区布局的随机化，通过增加攻击者预测目的地址的难度，防止攻击者直接定位攻击代码位置，达到阻止溢出攻击的目的的一种技术。  
  怎么知道一个`exe`程序启用了`ASLR`呢？它位于`PE`结构的一个成员，如下图所示：

![](https://img2022.cnblogs.com/blog/2520882/202203/2520882-20220326170528176-1273603809.png)

  我们可以将该成员改为0就可以取消随机基址保护，但是如果程序有自校验，且我们无法干掉，如何获得程序基地址呢？答案就是从`TEB`获取，如下是其结构体：

    kd> dt _teb
    nt!_TEB
       +0x000 NtTib            : _NT_TIB
       +0x01c EnvironmentPointer : Ptr32 Void
       +0x020 ClientId         : _CLIENT_ID  
       +0x028 ActiveRpcHandle  : Ptr32 Void
       +0x02c ThreadLocalStoragePointer : Ptr32 Void
       +0x030 ProcessEnvironmentBlock : Ptr32 _PEB
       +0x034 LastErrorValue   : Uint4B
       +0x038 CountOfOwnedCriticalSections : Uint4B
       +0x03c CsrClientThread  : Ptr32 Void
       +0x040 Win32ThreadInfo  : Ptr32 Void
       +0x044 User32Reserved   : [26] Uint4B
       +0x0ac UserReserved     : [5] Uint4B
       +0x0c0 WOW32Reserved    : Ptr32 Void
       +0x0c4 CurrentLocale    : Uint4B
       +0x0c8 FpSoftwareStatusRegister : Uint4B
       +0x0cc SystemReserved1  : [54] Ptr32 Void
       +0x1a4 ExceptionCode    : Int4B
       +0x1a8 ActivationContextStack : _ACTIVATION_CONTEXT_STACK
       +0x1bc SpareBytes1      : [24] UChar
       +0x1d4 GdiTebBatch      : _GDI_TEB_BATCH
       +0x6b4 RealClientId     : _CLIENT_ID
       +0x6bc GdiCachedProcessHandle : Ptr32 Void
       +0x6c0 GdiClientPID     : Uint4B
       +0x6c4 GdiClientTID     : Uint4B
       +0x6c8 GdiThreadLocalInfo : Ptr32 Void
       +0x6cc Win32ClientInfo  : [62] Uint4B
       +0x7c4 glDispatchTable  : [233] Ptr32 Void
       +0xb68 glReserved1      : [29] Uint4B
       +0xbdc glReserved2      : Ptr32 Void
       +0xbe0 glSectionInfo    : Ptr32 Void
       +0xbe4 glSection        : Ptr32 Void
       +0xbe8 glTable          : Ptr32 Void
       +0xbec glCurrentRC      : Ptr32 Void
       +0xbf0 glContext        : Ptr32 Void
       +0xbf4 LastStatusValue  : Uint4B
       +0xbf8 StaticUnicodeString : _UNICODE_STRING
       +0xc00 StaticUnicodeBuffer : [261] Uint2B
       +0xe0c DeallocationStack : Ptr32 Void
       +0xe10 TlsSlots         : [64] Ptr32 Void
       +0xf10 TlsLinks         : _LIST_ENTRY
       +0xf18 Vdm              : Ptr32 Void
       +0xf1c ReservedForNtRpc : Ptr32 Void
       +0xf20 DbgSsReserved    : [2] Ptr32 Void
       +0xf28 HardErrorsAreDisabled : Uint4B
       +0xf2c Instrumentation  : [16] Ptr32 Void
       +0xf6c WinSockData      : Ptr32 Void
       +0xf70 GdiBatchCount    : Uint4B
       +0xf74 InDbgPrint       : UChar
       +0xf75 FreeStackOnTermination : UChar
       +0xf76 HasFiberData     : UChar
       +0xf77 IdealProcessor   : UChar
       +0xf78 Spare3           : Uint4B
       +0xf7c ReservedForPerf  : Ptr32 Void
       +0xf80 ReservedForOle   : Ptr32 Void
       +0xf84 WaitingOnLoaderLock : Uint4B
       +0xf88 Wx86Thread       : _Wx86ThreadState
       +0xf94 TlsExpansionSlots : Ptr32 Ptr32 Void
       +0xf98 ImpersonationLocale : Uint4B
       +0xf9c IsImpersonating  : Uint4B
       +0xfa0 NlsCache         : Ptr32 Void
       +0xfa4 pShimData        : Ptr32 Void
       +0xfa8 HeapVirtualAffinity : Uint4B
       +0xfac CurrentTransactionHandle : Ptr32 Void
       +0xfb0 ActiveFrame      : Ptr32 _TEB_ACTIVE_FRAME
       +0xfb4 SafeThunkCall    : UChar
       +0xfb5 BooleanSpare     : [3] UChar
    

  要取得我们想要的程序基地址，我们需要从`TEB`获取`PEB`，也就是`0x30`偏移处的成员，如下是其结构：

    kd> dt _peb
    nt!_PEB
       +0x000 InheritedAddressSpace : UChar
       +0x001 ReadImageFileExecOptions : UChar
       +0x002 BeingDebugged    : UChar 
       +0x003 SpareBool        : UChar
       +0x004 Mutant           : Ptr32 Void
       +0x008 ImageBaseAddress : Ptr32 Void
       +0x00c Ldr              : Ptr32 _PEB_LDR_DATA
       +0x010 ProcessParameters : Ptr32 _RTL_USER_PROCESS_PARAMETERS
       +0x014 SubSystemData    : Ptr32 Void
       +0x018 ProcessHeap      : Ptr32 Void
       +0x01c FastPebLock      : Ptr32 _RTL_CRITICAL_SECTION
       +0x020 FastPebLockRoutine : Ptr32 Void
       +0x024 FastPebUnlockRoutine : Ptr32 Void
       +0x028 EnvironmentUpdateCount : Uint4B
       +0x02c KernelCallbackTable : Ptr32 Void
       +0x030 SystemReserved   : [1] Uint4B
       +0x034 AtlThunkSListPtr32 : Uint4B
       +0x038 FreeList         : Ptr32 _PEB_FREE_BLOCK
       +0x03c TlsExpansionCounter : Uint4B
       +0x040 TlsBitmap        : Ptr32 Void
       +0x044 TlsBitmapBits    : [2] Uint4B
       +0x04c ReadOnlySharedMemoryBase : Ptr32 Void
       +0x050 ReadOnlySharedMemoryHeap : Ptr32 Void
       +0x054 ReadOnlyStaticServerData : Ptr32 Ptr32 Void
       +0x058 AnsiCodePageData : Ptr32 Void
       +0x05c OemCodePageData  : Ptr32 Void
       +0x060 UnicodeCaseTableData : Ptr32 Void
       +0x064 NumberOfProcessors : Uint4B
       +0x068 NtGlobalFlag     : Uint4B
       +0x070 CriticalSectionTimeout : _LARGE_INTEGER
       +0x078 HeapSegmentReserve : Uint4B
       +0x07c HeapSegmentCommit : Uint4B
       +0x080 HeapDeCommitTotalFreeThreshold : Uint4B
       +0x084 HeapDeCommitFreeBlockThreshold : Uint4B
       +0x088 NumberOfHeaps    : Uint4B
       +0x08c MaximumNumberOfHeaps : Uint4B
       +0x090 ProcessHeaps     : Ptr32 Ptr32 Void
       +0x094 GdiSharedHandleTable : Ptr32 Void
       +0x098 ProcessStarterHelper : Ptr32 Void
       +0x09c GdiDCAttributeList : Uint4B
       +0x0a0 LoaderLock       : Ptr32 Void
       +0x0a4 OSMajorVersion   : Uint4B
       +0x0a8 OSMinorVersion   : Uint4B
       +0x0ac OSBuildNumber    : Uint2B
       +0x0ae OSCSDVersion     : Uint2B
       +0x0b0 OSPlatformId     : Uint4B
       +0x0b4 ImageSubsystem   : Uint4B
       +0x0b8 ImageSubsystemMajorVersion : Uint4B
       +0x0bc ImageSubsystemMinorVersion : Uint4B
       +0x0c0 ImageProcessAffinityMask : Uint4B
       +0x0c4 GdiHandleBuffer  : [34] Uint4B
       +0x14c PostProcessInitRoutine : Ptr32     void 
       +0x150 TlsExpansionBitmap : Ptr32 Void
       +0x154 TlsExpansionBitmapBits : [32] Uint4B
       +0x1d4 SessionId        : Uint4B
       +0x1d8 AppCompatFlags   : _ULARGE_INTEGER
       +0x1e0 AppCompatFlagsUser : _ULARGE_INTEGER
       +0x1e8 pShimData        : Ptr32 Void
       +0x1ec AppCompatInfo    : Ptr32 Void
       +0x1f0 CSDVersion       : _UNICODE_STRING
       +0x1f8 ActivationContextData : Ptr32 Void
       +0x1fc ProcessAssemblyStorageMap : Ptr32 Void
       +0x200 SystemDefaultActivationContextData : Ptr32 Void
       +0x204 SystemAssemblyStorageMap : Ptr32 Void
       +0x208 MinimumStackCommit : Uint4B
    

  `ImageBaseAddress`就是镜像加载地址，通过它我们就可以获得程序被加载到内存的首地址。  
  上面巴拉巴拉一大堆没说`TEB`如何获取，它存储在`fs`寄存器中，我们可以用如下代码进行获取：

    mov eax,dword ptr fs:[0x30];
    mov eax,dword ptr ds:[eax+0x8];
    

  注意，**如上是在32位系统下才有效**，对于64位系统下运行64位程序的`TEB`和`PEB`结构体发生了一些变化：  
  `PEB`结构体：

    kd> dt _PEB
    nt!_PEB
       +0x000 InheritedAddressSpace : UChar
       +0x001 ReadImageFileExecOptions : UChar
       +0x002 BeingDebugged    : UChar
       +0x003 BitField         : UChar
       +0x003 ImageUsesLargePages : Pos 0, 1 Bit
       +0x003 IsProtectedProcess : Pos 1, 1 Bit
       +0x003 IsImageDynamicallyRelocated : Pos 2, 1 Bit
       +0x003 SkipPatchingUser32Forwarders : Pos 3, 1 Bit
       +0x003 IsPackagedProcess : Pos 4, 1 Bit
       +0x003 IsAppContainer   : Pos 5, 1 Bit
       +0x003 IsProtectedProcessLight : Pos 6, 1 Bit
       +0x003 IsLongPathAwareProcess : Pos 7, 1 Bit
       +0x004 Padding0         : [4] UChar
       +0x008 Mutant           : Ptr64 Void
       +0x010 ImageBaseAddress : Ptr64 Void
       +0x018 Ldr              : Ptr64 _PEB_LDR_DATA
       +0x020 ProcessParameters : Ptr64 _RTL_USER_PROCESS_PARAMETERS
       +0x028 SubSystemData    : Ptr64 Void
       +0x030 ProcessHeap      : Ptr64 Void
       +0x038 FastPebLock      : Ptr64 _RTL_CRITICAL_SECTION
       +0x040 AtlThunkSListPtr : Ptr64 _SLIST_HEADER
       +0x048 IFEOKey          : Ptr64 Void
       +0x050 CrossProcessFlags : Uint4B
       +0x050 ProcessInJob     : Pos 0, 1 Bit
       +0x050 ProcessInitializing : Pos 1, 1 Bit
       +0x050 ProcessUsingVEH  : Pos 2, 1 Bit
       +0x050 ProcessUsingVCH  : Pos 3, 1 Bit
       +0x050 ProcessUsingFTH  : Pos 4, 1 Bit
       +0x050 ProcessPreviouslyThrottled : Pos 5, 1 Bit
       +0x050 ProcessCurrentlyThrottled : Pos 6, 1 Bit
       +0x050 ProcessImagesHotPatched : Pos 7, 1 Bit
       +0x050 ReservedBits0    : Pos 8, 24 Bits
       +0x054 Padding1         : [4] UChar
       +0x058 KernelCallbackTable : Ptr64 Void
       +0x058 UserSharedInfoPtr : Ptr64 Void
       +0x060 SystemReserved   : Uint4B
       +0x064 AtlThunkSListPtr32 : Uint4B
       +0x068 ApiSetMap        : Ptr64 Void
       +0x070 TlsExpansionCounter : Uint4B
       +0x074 Padding2         : [4] UChar
       +0x078 TlsBitmap        : Ptr64 Void
       +0x080 TlsBitmapBits    : [2] Uint4B
       +0x088 ReadOnlySharedMemoryBase : Ptr64 Void
       +0x090 SharedData       : Ptr64 Void
       +0x098 ReadOnlyStaticServerData : Ptr64 Ptr64 Void
       +0x0a0 AnsiCodePageData : Ptr64 Void
       +0x0a8 OemCodePageData  : Ptr64 Void
       +0x0b0 UnicodeCaseTableData : Ptr64 Void
       +0x0b8 NumberOfProcessors : Uint4B
       +0x0bc NtGlobalFlag     : Uint4B
       +0x0c0 CriticalSectionTimeout : _LARGE_INTEGER
       +0x0c8 HeapSegmentReserve : Uint8B
       +0x0d0 HeapSegmentCommit : Uint8B
       +0x0d8 HeapDeCommitTotalFreeThreshold : Uint8B
       +0x0e0 HeapDeCommitFreeBlockThreshold : Uint8B
       +0x0e8 NumberOfHeaps    : Uint4B
       +0x0ec MaximumNumberOfHeaps : Uint4B
       +0x0f0 ProcessHeaps     : Ptr64 Ptr64 Void
       +0x0f8 GdiSharedHandleTable : Ptr64 Void
       +0x100 ProcessStarterHelper : Ptr64 Void
       +0x108 GdiDCAttributeList : Uint4B
       +0x10c Padding3         : [4] UChar
       +0x110 LoaderLock       : Ptr64 _RTL_CRITICAL_SECTION
       +0x118 OSMajorVersion   : Uint4B
       +0x11c OSMinorVersion   : Uint4B
       +0x120 OSBuildNumber    : Uint2B
       +0x122 OSCSDVersion     : Uint2B
       +0x124 OSPlatformId     : Uint4B
       +0x128 ImageSubsystem   : Uint4B
       +0x12c ImageSubsystemMajorVersion : Uint4B
       +0x130 ImageSubsystemMinorVersion : Uint4B
       +0x134 Padding4         : [4] UChar
       +0x138 ActiveProcessAffinityMask : Uint8B
       +0x140 GdiHandleBuffer  : [60] Uint4B
       +0x230 PostProcessInitRoutine : Ptr64     void 
       +0x238 TlsExpansionBitmap : Ptr64 Void
       +0x240 TlsExpansionBitmapBits : [32] Uint4B
       +0x2c0 SessionId        : Uint4B
       +0x2c4 Padding5         : [4] UChar
       +0x2c8 AppCompatFlags   : _ULARGE_INTEGER
       +0x2d0 AppCompatFlagsUser : _ULARGE_INTEGER
       +0x2d8 pShimData        : Ptr64 Void
       +0x2e0 AppCompatInfo    : Ptr64 Void
       +0x2e8 CSDVersion       : _UNICODE_STRING
       +0x2f8 ActivationContextData : Ptr64 _ACTIVATION_CONTEXT_DATA
       +0x300 ProcessAssemblyStorageMap : Ptr64 _ASSEMBLY_STORAGE_MAP
       +0x308 SystemDefaultActivationContextData : Ptr64 _ACTIVATION_CONTEXT_DATA
       +0x310 SystemAssemblyStorageMap : Ptr64 _ASSEMBLY_STORAGE_MAP
       +0x318 MinimumStackCommit : Uint8B
       +0x320 SparePointers    : [4] Ptr64 Void
       +0x340 SpareUlongs      : [5] Uint4B
       +0x358 WerRegistrationData : Ptr64 Void
       +0x360 WerShipAssertPtr : Ptr64 Void
       +0x368 pUnused          : Ptr64 Void
       +0x370 pImageHeaderHash : Ptr64 Void
       +0x378 TracingFlags     : Uint4B
       +0x378 HeapTracingEnabled : Pos 0, 1 Bit
       +0x378 CritSecTracingEnabled : Pos 1, 1 Bit
       +0x378 LibLoaderTracingEnabled : Pos 2, 1 Bit
       +0x378 SpareTracingBits : Pos 3, 29 Bits
       +0x37c Padding6         : [4] UChar
       +0x380 CsrServerReadOnlySharedMemoryBase : Uint8B
       +0x388 TppWorkerpListLock : Uint8B
       +0x390 TppWorkerpList   : _LIST_ENTRY
       +0x3a0 WaitOnAddressHashTable : [128] Ptr64 Void
       +0x7a0 TelemetryCoverageHeader : Ptr64 Void
       +0x7a8 CloudFileFlags   : Uint4B
       +0x7ac CloudFileDiagFlags : Uint4B
       +0x7b0 PlaceholderCompatibilityMode : Char
       +0x7b1 PlaceholderCompatibilityModeReserved : [7] Char
       +0x7b8 LeapSecondData   : Ptr64 _LEAP_SECOND_DATA
       +0x7c0 LeapSecondFlags  : Uint4B
       +0x7c0 SixtySecondEnabled : Pos 0, 1 Bit
       +0x7c0 Reserved         : Pos 1, 31 Bits
       +0x7c4 NtGlobalFlag2    : Uint4B
    

  `TEB`结构体：

    kd> dt _TEB
    nt!_TEB
       +0x000 NtTib            : _NT_TIB
       +0x038 EnvironmentPointer : Ptr64 Void
       +0x040 ClientId         : _CLIENT_ID
       +0x050 ActiveRpcHandle  : Ptr64 Void
       +0x058 ThreadLocalStoragePointer : Ptr64 Void
       +0x060 ProcessEnvironmentBlock : Ptr64 _PEB
       +0x068 LastErrorValue   : Uint4B
       +0x06c CountOfOwnedCriticalSections : Uint4B
       +0x070 CsrClientThread  : Ptr64 Void
       +0x078 Win32ThreadInfo  : Ptr64 Void
       +0x080 User32Reserved   : [26] Uint4B
       +0x0e8 UserReserved     : [5] Uint4B
       +0x100 WOW32Reserved    : Ptr64 Void
       +0x108 CurrentLocale    : Uint4B
       +0x10c FpSoftwareStatusRegister : Uint4B
       +0x110 ReservedForDebuggerInstrumentation : [16] Ptr64 Void
       +0x190 SystemReserved1  : [30] Ptr64 Void
       +0x280 PlaceholderCompatibilityMode : Char
       +0x281 PlaceholderHydrationAlwaysExplicit : UChar
       +0x282 PlaceholderReserved : [10] Char
       +0x28c ProxiedProcessId : Uint4B
       +0x290 _ActivationStack : _ACTIVATION_CONTEXT_STACK
       +0x2b8 WorkingOnBehalfTicket : [8] UChar
       +0x2c0 ExceptionCode    : Int4B
       +0x2c4 Padding0         : [4] UChar
       +0x2c8 ActivationContextStackPointer : Ptr64 _ACTIVATION_CONTEXT_STACK
       +0x2d0 InstrumentationCallbackSp : Uint8B
       +0x2d8 InstrumentationCallbackPreviousPc : Uint8B
       +0x2e0 InstrumentationCallbackPreviousSp : Uint8B
       +0x2e8 TxFsContext      : Uint4B
       +0x2ec InstrumentationCallbackDisabled : UChar
       +0x2ed UnalignedLoadStoreExceptions : UChar
       +0x2ee Padding1         : [2] UChar
       +0x2f0 GdiTebBatch      : _GDI_TEB_BATCH
       +0x7d8 RealClientId     : _CLIENT_ID
       +0x7e8 GdiCachedProcessHandle : Ptr64 Void
       +0x7f0 GdiClientPID     : Uint4B
       +0x7f4 GdiClientTID     : Uint4B
       +0x7f8 GdiThreadLocalInfo : Ptr64 Void
       +0x800 Win32ClientInfo  : [62] Uint8B
       +0x9f0 glDispatchTable  : [233] Ptr64 Void
       +0x1138 glReserved1      : [29] Uint8B
       +0x1220 glReserved2      : Ptr64 Void
       +0x1228 glSectionInfo    : Ptr64 Void
       +0x1230 glSection        : Ptr64 Void
       +0x1238 glTable          : Ptr64 Void
       +0x1240 glCurrentRC      : Ptr64 Void
       +0x1248 glContext        : Ptr64 Void
       +0x1250 LastStatusValue  : Uint4B
       +0x1254 Padding2         : [4] UChar
       +0x1258 StaticUnicodeString : _UNICODE_STRING
       +0x1268 StaticUnicodeBuffer : [261] Wchar
       +0x1472 Padding3         : [6] UChar
       +0x1478 DeallocationStack : Ptr64 Void
       +0x1480 TlsSlots         : [64] Ptr64 Void
       +0x1680 TlsLinks         : _LIST_ENTRY
       +0x1690 Vdm              : Ptr64 Void
       +0x1698 ReservedForNtRpc : Ptr64 Void
       +0x16a0 DbgSsReserved    : [2] Ptr64 Void
       +0x16b0 HardErrorMode    : Uint4B
       +0x16b4 Padding4         : [4] UChar
       +0x16b8 Instrumentation  : [11] Ptr64 Void
       +0x1710 ActivityId       : _GUID
       +0x1720 SubProcessTag    : Ptr64 Void
       +0x1728 PerflibData      : Ptr64 Void
       +0x1730 EtwTraceData     : Ptr64 Void
       +0x1738 WinSockData      : Ptr64 Void
       +0x1740 GdiBatchCount    : Uint4B
       +0x1744 CurrentIdealProcessor : _PROCESSOR_NUMBER
       +0x1744 IdealProcessorValue : Uint4B
       +0x1744 ReservedPad0     : UChar
       +0x1745 ReservedPad1     : UChar
       +0x1746 ReservedPad2     : UChar
       +0x1747 IdealProcessor   : UChar
       +0x1748 GuaranteedStackBytes : Uint4B
       +0x174c Padding5         : [4] UChar
       +0x1750 ReservedForPerf  : Ptr64 Void
       +0x1758 ReservedForOle   : Ptr64 Void
       +0x1760 WaitingOnLoaderLock : Uint4B
       +0x1764 Padding6         : [4] UChar
       +0x1768 SavedPriorityState : Ptr64 Void
       +0x1770 ReservedForCodeCoverage : Uint8B
       +0x1778 ThreadPoolData   : Ptr64 Void
       +0x1780 TlsExpansionSlots : Ptr64 Ptr64 Void
       +0x1788 DeallocationBStore : Ptr64 Void
       +0x1790 BStoreLimit      : Ptr64 Void
       +0x1798 MuiGeneration    : Uint4B
       +0x179c IsImpersonating  : Uint4B
       +0x17a0 NlsCache         : Ptr64 Void
       +0x17a8 pShimData        : Ptr64 Void
       +0x17b0 HeapData         : Uint4B
       +0x17b4 Padding7         : [4] UChar
       +0x17b8 CurrentTransactionHandle : Ptr64 Void
       +0x17c0 ActiveFrame      : Ptr64 _TEB_ACTIVE_FRAME
       +0x17c8 FlsData          : Ptr64 Void
       +0x17d0 PreferredLanguages : Ptr64 Void
       +0x17d8 UserPrefLanguages : Ptr64 Void
       +0x17e0 MergedPrefLanguages : Ptr64 Void
       +0x17e8 MuiImpersonation : Uint4B
       +0x17ec CrossTebFlags    : Uint2B
       +0x17ec SpareCrossTebBits : Pos 0, 16 Bits
       +0x17ee SameTebFlags     : Uint2B
       +0x17ee SafeThunkCall    : Pos 0, 1 Bit
       +0x17ee InDebugPrint     : Pos 1, 1 Bit
       +0x17ee HasFiberData     : Pos 2, 1 Bit
       +0x17ee SkipThreadAttach : Pos 3, 1 Bit
       +0x17ee WerInShipAssertCode : Pos 4, 1 Bit
       +0x17ee RanProcessInit   : Pos 5, 1 Bit
       +0x17ee ClonedThread     : Pos 6, 1 Bit
       +0x17ee SuppressDebugMsg : Pos 7, 1 Bit
       +0x17ee DisableUserStackWalk : Pos 8, 1 Bit
       +0x17ee RtlExceptionAttached : Pos 9, 1 Bit
       +0x17ee InitialThread    : Pos 10, 1 Bit
       +0x17ee SessionAware     : Pos 11, 1 Bit
       +0x17ee LoadOwner        : Pos 12, 1 Bit
       +0x17ee LoaderWorker     : Pos 13, 1 Bit
       +0x17ee SkipLoaderInit   : Pos 14, 1 Bit
       +0x17ee SpareSameTebBits : Pos 15, 1 Bit
       +0x17f0 TxnScopeEnterCallback : Ptr64 Void
       +0x17f8 TxnScopeExitCallback : Ptr64 Void
       +0x1800 TxnScopeContext  : Ptr64 Void
       +0x1808 LockCount        : Uint4B
       +0x180c WowTebOffset     : Int4B
       +0x1810 ResourceRetValue : Ptr64 Void
       +0x1818 ReservedForWdf   : Ptr64 Void
       +0x1820 ReservedForCrt   : Uint8B
       +0x1828 EffectiveContainerId : _GUID
    

  并且存放`TEB`的寄存器变了，变成了`gs`，具体细节请自行学习 **[羽夏看Win系统内核](https://www.cnblogs.com/wingsummer/category/2032169.html)** 系列教程。所以代码发生了一些变化，但仍不复杂：

    mov rax, qword ptr gs:[0x60];
    mov rax, qword ptr ds:[rax+0x10];
    

  有关随机基址相关介绍，就这么多。

软件断点反制
------

  很多破解者找突破口的时候都会在关键函数下断点，并且下的断点都是普通的软件断点，有关断点的介绍请自行阅读 **[调试篇——断点与单步](https://www.cnblogs.com/wingsummer/p/15960780.html)** 里面有比较与软件断点详细的介绍，我就不在这里赘述了，下面我们实现简单的反制措施：

    #include <iostream>
    #include <Windows.h>
    #include <stdlib.h>
    using namespace std;
    
    BYTE* proc = 0;
    
    UINT WINAPI ThreadProc(LPVOID Param)
    {
        cout << "开始检测中……" << endl;
        while (true)
        {
            if (*proc == 0xCC)
                cout << "检测被下软件断点！！！" << endl;
        }
        return 0;
    }
    
    int main()
    {
        HMODULE lib = LoadLibrary(L"user32.dll");
        FARPROC msgboxw = GetProcAddress(lib, "MessageBoxW");
        proc = (BYTE*)msgboxw;
